In [1]:
from sqlalchemy import create_engine
import pandas as pd
from config import username
from config import password
health_engine = create_engine(f"postgresql://{username}:{password}@localhost:5432/Health_db")
connection = health_engine.connect()

In [2]:
sales = pd.read_sql_table("inhaler_sales", connection)
sales.head()

  SA4_code        SA4_name    Week  18_19_n  19_20_n
0      101  Capital Region  02-Sep     2630     2622
1      101  Capital Region  09-Sep     2427     2521
2      101  Capital Region  16-Sep     2547     2586
3      101  Capital Region  23-Sep     2599     2540
4      101  Capital Region  30-Sep     2416     2713

In [3]:
copd = pd.read_sql_table("copd_exacerbation", connection)
copd.head()

     Week  17_18_n  17_18_ASR  18_19_n  18_19_ASR  19_20_n  19-20_ASR
0  01-Sep      176     1.8350      167     1.6826      217     2.1805
1  08-Sep      146     1.5916      186     1.8784      182     1.8121
2  15-Sep      156     1.6484      190     1.9740      183     1.8161
3  22-Sep      147     1.5791      191     1.9618      179     1.7806
4  29-Sep      127     1.3378      175     1.7989      173     1.7022

In [22]:
query = """
SELECT * FROM inhaler_sales 
""" 
inhaler_sales = pd.read_sql(query, connection)
inhaler_sales.head()

  SA4_code        SA4_name    Week  18_19_n  19_20_n
0      101  Capital Region  02-Sep     2630     2622
1      101  Capital Region  09-Sep     2427     2521
2      101  Capital Region  16-Sep     2547     2586
3      101  Capital Region  23-Sep     2599     2540
4      101  Capital Region  30-Sep     2416     2713

In [24]:
query = """
select * from asthma
"""
asthma = pd.read_sql(query, connection)
asthma.head()

     Week  17_18_n  17_18_ASR  18_19_n  18_19_ASR  19_20_n  19-20_ASR
0  01-Sep      492   6.356113      535   6.859555      547   6.963176
1  08-Sep      561   7.231490      517   6.627799      498   6.412864
2  15-Sep      480   6.141363      453   5.789469      499   6.355923
3  22-Sep      465   6.002258      459   5.935005      487   6.173867
4  29-Sep      430   5.490438      529   6.879513      460   5.886051

In [23]:
query = """
SELECT * FROM breathing_abnormalities
"""
breathing_abnormalities = pd.read_sql(query, connection)
breathing_abnormalities.head()

     Week  17_18_n  17_18_ASR  18_19_n  18_19_ASR  19_20_n  19-20_ASR
0  01-Sep      687   7.846421      701     8.1332      773     8.8406
1  08-Sep      697   8.006511      738     8.6096      758     8.6510
2  15-Sep      652   7.523105      713     8.1818      749     8.6074
3  22-Sep      674   7.855317      709     8.2906      777     8.9203
4  29-Sep      631   7.337755      668     7.7956      775     8.8677